config/gptel/scope/test/integration/bash-parser-integration-spec.el
;;; bash-parser-integration-spec.el --- Wiring tests: real bash-parser → contract → real scope validation -*- lexical-binding: t; -*-

;; Copyright (C) 2026 Jeff Farr

;; Author: Jeff Farr
;; Keywords: tests

;;; Commentary:

;; Phase 3 integration tests: validate that real bash-parser output flows through
;; real scope validation without mocks.  Each test:
;;   1. Calls jf/bash-parse (real tree-sitter parse)
;;   2. Validates parse result against contract
;;   3. Calls jf/bash-extract-semantics (real plugin pipeline)
;;   4. Validates semantics against contract
;;   5. Feeds to jf/gptel-scope--validate-command-semantics (real 7-stage pipeline)
;;   6. Asserts expected outcome (allowed/denied/warning)
;;
;; These tests catch format mismatches that unit tests with mocks cannot detect.
;; Requires tree-sitter bash grammar to be installed.

;;; Code:

(require 'buttercup)
(require 'cl-lib)

;; Load dependencies via path resolution
(let* ((test-dir (file-name-directory (or load-file-name buffer-file-name)))
       ;; test/integration/ -> test/ -> scope/ -> gptel/ -> config/
       (scope-test-dir (expand-file-name ".." test-dir))
       (scope-dir (expand-file-name ".." scope-test-dir))
       (gptel-dir (expand-file-name ".." scope-dir))
       (config-dir (expand-file-name ".." gptel-dir))
       (contracts-dir (expand-file-name "test/contracts/" config-dir)))
  ;; Contract infrastructure
  (add-to-list 'load-path contracts-dir)
  (require 'contract-core)
  (require 'contract-bash-parser)
  (contract--register-buttercup-matcher)
  ;; Scope validation (pulls in bash-parser-core, bash-parser-plugins)
  (require 'jf-gptel-scope-shell-tools
           (expand-file-name "scope/scope-shell-tools.el" gptel-dir))
  ;; Helpers for scope config builders
  (require 'helpers-spec (expand-file-name "helpers-spec.el" scope-test-dir)))

;;; Scope config fixtures

(defun integration-spec--workspace-scope-config ()
  "Scope config allowing read/write under /workspace, denying rm."
  (let ((scope-yml (helpers-spec-make-minimal-scope)))
    (unwind-protect
        (helpers-spec-load-scope-config scope-yml)
      (delete-file scope-yml))))

(defun integration-spec--cloud-deny-scope-config ()
  "Scope config with cloud auth set to deny."
  (let ((scope-yml (helpers-spec-make-scope-with-cloud-deny)))
    (unwind-protect
        (helpers-spec-load-scope-config scope-yml)
      (delete-file scope-yml))))

;;; Test suites

(describe "Bash-parser → scope integration (real modules, no mocks)"

  (let (workspace-config cloud-deny-config)

    (before-all
      (setq workspace-config (integration-spec--workspace-scope-config))
      (setq cloud-deny-config (integration-spec--cloud-deny-scope-config)))

    ;; -- Scenario 1: simple read, allowed --
    (describe "cat /workspace/file.txt (simple read)"
      (it "parse result satisfies contract"
        (let ((parsed (jf/bash-parse "cat /workspace/file.txt")))
          (expect parsed :to-satisfy-contract #'contract/bash-parse-result--validate)))

      (it "semantics satisfy contract"
        (let* ((parsed (jf/bash-parse "cat /workspace/file.txt"))
               (semantics (jf/bash-extract-semantics parsed)))
          (expect semantics :to-satisfy-contract #'contract/bash-semantics--validate)))

      (it "extracts filesystem read operation"
        (let* ((parsed (jf/bash-parse "cat /workspace/file.txt"))
               (semantics (jf/bash-extract-semantics parsed))
               (file-ops (alist-get :filesystem (plist-get semantics :domains))))
          (expect file-ops :not :to-be nil)
          (expect (cl-some (lambda (op) (eq (plist-get op :operation) :read)) file-ops)
                  :to-be-truthy)))

      (it "is allowed by scope validation"
        (let ((result (jf/gptel-scope--validate-command-semantics
                       "cat /workspace/file.txt" "/workspace" workspace-config)))
          (expect result :to-be nil))))

    ;; -- Scenario 2: read with glob --
    (describe "grep pattern /workspace/*.txt (read with glob)"
      (it "parse result satisfies contract"
        (let ((parsed (jf/bash-parse "grep pattern /workspace/*.txt")))
          (expect parsed :to-satisfy-contract #'contract/bash-parse-result--validate)))

      (it "semantics satisfy contract"
        (let* ((parsed (jf/bash-parse "grep pattern /workspace/*.txt"))
               (semantics (jf/bash-extract-semantics parsed)))
          (expect semantics :to-satisfy-contract #'contract/bash-semantics--validate)))

      (it "is allowed by scope validation"
        (let ((result (jf/gptel-scope--validate-command-semantics
                       "grep pattern /workspace/*.txt" "/workspace" workspace-config)))
          (expect result :to-be nil))))

    ;; -- Scenario 3: write via redirection --
    ;; Note: bash-parser's redirect extraction depends on the command having a
    ;; registered handler or the universal file-ops plugin detecting the redirect.
    ;; echo with redirect may or may not produce file-ops depending on plugin coverage.
    (describe "echo hello > /workspace/out.txt (write via redirection)"
      (it "parse result satisfies contract"
        (let ((parsed (jf/bash-parse "echo hello > /workspace/out.txt")))
          (expect parsed :to-satisfy-contract #'contract/bash-parse-result--validate)))

      (it "semantics satisfy contract"
        (let* ((parsed (jf/bash-parse "echo hello > /workspace/out.txt"))
               (semantics (jf/bash-extract-semantics parsed)))
          (expect semantics :to-satisfy-contract #'contract/bash-semantics--validate)))

      (it "is allowed by scope validation (treated as no-op if redirect not extracted)"
        (let ((result (jf/gptel-scope--validate-command-semantics
                       "echo hello > /workspace/out.txt" "/workspace" workspace-config)))
          (expect result :to-be nil))))

    ;; -- Scenario 4: cloud auth detection --
    ;; Known gap: scope's validate-cloud-auth does (plist-get cloud-auth-ops :provider)
    ;; but receives a list-of-plists from (alist-get :authentication domains).
    ;; plist-get on a list-of-plists returns nil, so cloud auth validation is
    ;; silently bypassed.  See "The List-of-Plists Bug" section below.
    (describe "aws s3 ls (cloud auth detection)"
      (it "parse result satisfies contract"
        (let ((parsed (jf/bash-parse "aws s3 ls")))
          (expect parsed :to-satisfy-contract #'contract/bash-parse-result--validate)))

      (it "semantics satisfy contract"
        (let* ((parsed (jf/bash-parse "aws s3 ls"))
               (semantics (jf/bash-extract-semantics parsed)))
          (expect semantics :to-satisfy-contract #'contract/bash-semantics--validate)))

      (it "extracts :authentication domain"
        (let* ((parsed (jf/bash-parse "aws s3 ls"))
               (semantics (jf/bash-extract-semantics parsed))
               (auth-ops (alist-get :authentication (plist-get semantics :domains))))
          (expect auth-ops :not :to-be nil)
          ;; bash-parser produces list-of-plists for domain values
          (expect (car auth-ops) :to-satisfy-contract #'contract/bash-cloud-auth-op--validate)))

      ;; Known gap: scope's validate-cloud-auth does (plist-get cloud-auth-ops :provider)
      ;; but receives a list-of-plists from (alist-get :authentication domains).
      ;; plist-get on a list-of-plists returns nil, so cloud auth validation is silently bypassed.
      ;; This test documents the actual (broken) behavior.
      (it "cloud auth is silently bypassed due to list-of-plists gap (known bug)"
        (let ((result (jf/gptel-scope--validate-command-semantics
                       "aws s3 ls" "/workspace" cloud-deny-config)))
          ;; EXPECTED: should return error plist with :error "cloud_auth_denied"
          ;; ACTUAL: returns nil (allowed) because plist-get on list-of-plists returns nil
          (expect result :to-be nil))))

    ;; -- Scenario 5: no-op short circuit --
    (describe "python3 --version (no-op short circuit)"
      (it "parse result satisfies contract"
        (let ((parsed (jf/bash-parse "python3 --version")))
          (expect parsed :to-satisfy-contract #'contract/bash-parse-result--validate)))

      (it "semantics satisfy contract"
        (let* ((parsed (jf/bash-parse "python3 --version"))
               (semantics (jf/bash-extract-semantics parsed)))
          (expect semantics :to-satisfy-contract #'contract/bash-semantics--validate)))

      (it "has no filesystem operations"
        (let* ((parsed (jf/bash-parse "python3 --version"))
               (semantics (jf/bash-extract-semantics parsed))
               (file-ops (alist-get :filesystem (plist-get semantics :domains))))
          (expect file-ops :to-be nil)))

      (it "is allowed by scope validation (no-op)"
        (let ((result (jf/gptel-scope--validate-command-semantics
                       "python3 --version" "/workspace" workspace-config)))
          (expect result :to-be nil))))

    ;; -- Scenario 6: pipeline --
    (describe "cat /workspace/a.txt | head -10 (pipeline)"
      (it "parse result satisfies contract"
        (let ((parsed (jf/bash-parse "cat /workspace/a.txt | head -10")))
          (expect parsed :to-satisfy-contract #'contract/bash-parse-result--validate)))

      (it "semantics satisfy contract"
        (let* ((parsed (jf/bash-parse "cat /workspace/a.txt | head -10"))
               (semantics (jf/bash-extract-semantics parsed)))
          (expect semantics :to-satisfy-contract #'contract/bash-semantics--validate)))

      (it "is allowed by scope validation"
        (let ((result (jf/gptel-scope--validate-command-semantics
                       "cat /workspace/a.txt | head -10" "/workspace" workspace-config)))
          (expect result :to-be nil))))

    ;; -- Scenario 7: denied command --
    (describe "rm /workspace/file.txt (denied command)"
      (it "parse result satisfies contract"
        (let ((parsed (jf/bash-parse "rm /workspace/file.txt")))
          (expect parsed :to-satisfy-contract #'contract/bash-parse-result--validate)))

      (it "semantics satisfy contract"
        (let* ((parsed (jf/bash-parse "rm /workspace/file.txt"))
               (semantics (jf/bash-extract-semantics parsed)))
          (expect semantics :to-satisfy-contract #'contract/bash-semantics--validate)))

      (it "is denied by scope validation"
        (let ((result (jf/gptel-scope--validate-command-semantics
                       "rm /workspace/file.txt" "/workspace" workspace-config)))
          (expect result :not :to-be nil)
          (expect (plist-get result :error) :to-equal "command_denied"))))

    ;; -- Scenario 8: directory read --
    (describe "ls /workspace (directory read)"
      (it "parse result satisfies contract"
        (let ((parsed (jf/bash-parse "ls /workspace")))
          (expect parsed :to-satisfy-contract #'contract/bash-parse-result--validate)))

      (it "semantics satisfy contract"
        (let* ((parsed (jf/bash-parse "ls /workspace"))
               (semantics (jf/bash-extract-semantics parsed)))
          (expect semantics :to-satisfy-contract #'contract/bash-semantics--validate)))

      (it "is allowed by scope validation"
        (let ((result (jf/gptel-scope--validate-command-semantics
                       "ls /workspace" "/workspace" workspace-config)))
          (expect result :to-be nil))))

    ;; -- Bonus: contract validates each file-op individually --
    (describe "contract validation on individual file-ops from real parser"
      (it "every file-op from 'cat /workspace/file.txt' satisfies contract"
        (let* ((parsed (jf/bash-parse "cat /workspace/file.txt"))
               (semantics (jf/bash-extract-semantics parsed))
               (file-ops (alist-get :filesystem (plist-get semantics :domains))))
          (dolist (op file-ops)
            (expect op :to-satisfy-contract #'contract/bash-file-op--validate))))

      (it "every cloud-auth-op from 'aws s3 ls' satisfies contract"
        (let* ((parsed (jf/bash-parse "aws s3 ls"))
               (semantics (jf/bash-extract-semantics parsed))
               (auth-ops (alist-get :authentication (plist-get semantics :domains))))
          (dolist (op auth-ops)
            (expect op :to-satisfy-contract #'contract/bash-cloud-auth-op--validate)))))))

(provide 'bash-parser-integration-spec)

;;; bash-parser-integration-spec.el ends here
